{
  "projects": [
    {
      "year": 1,
      "name": "template",
      "description": "template",
      "image": "src/assets/mindstorm.png",
      "route": "/",
      "icon": "help",
      "content": ""
    },
    {
      "year": 2017,
      "name": "Mindstorms",
      "description": "I first started playing with mindstorms in 2017, this is where my initial love for programming and building robots came from! The Mindstorm lego sets let me build whatever I wanted and allowed me to teach myself basic programming skills, in the form of the Mindstorm programming app and scratch. Among the more memorable projects that I worked on in this time are: Making my first bipedal robot and entering the RoboCup Jr competition for my primary school and becoming a finalist.",
      "image": "src/assets/mindstorm.png",
      "route": null,
      "icon": null
    },
    {
      "year": 2020,
      "name": "Arduino",
      "description": "As a school project I was introduced to ",
      "route": null
    },
    {
      "year": 2020,
      "name": "Minecraft",
      "description": "My friends and I discover the amazing world of Minecraft servers! I tried a number of different server hosting providers setting with Shockbyte hosting for quite some time as their interface made it easy for us to test out different custom plugins. My curiosity then led me to learn Java so that I could make plugins of my own.",
      "image": null,
      "route": null,
      "icon": null
    },
    {
      "year": 2021,
      "name": "Indrocraft MC server",
      "description": "I eventually took my newfound Java skills further creating the Indrocraft server, dedicated to students at my high school (at the time I was in grade 10). I launched this server at the start of a COVID-19 lockdown and had an instant rush of players! The server was running on a dell power edge server with 48GB of ram that I was given by a friend. At the servers peak it had 200 members and was always active boasting 3 worlds networked together each with a selection of custom plugins that can be found at this link:",
      "image": null,
      "route": null,
      "icon": null
    },
    {
      "year": 2021,
      "name": "Terrain Generator",
      "description": "My first attempt at creating a terrain generation algorithm.",
      "image": null,
      "route": "/terrain-gen",
      "icon": "satellite"
    },
    {
      "year": 2023,
      "name": "Genetic Algorithm",
      "description": "As a starting point for machine learning I decided to make some basic genetic algorithms. My first one was a terminal app that tried to solve a polynomial with three values and let you change the mutation rate, selection rate, and the population size. Then after this I decided to look into the c++ SFML library to make a UI based genetic algorithm. The code for all of these projects is available on my github.",
      "image": null,
      "route": "/genetic-algorithms",
      "icon": "psychology"
    }
  ]
}